# Topic 5: Grouping & Aggregation in Pandas

In [2]:
import numpy as np
import pandas as pd

## Task 1

In [3]:
data = {
    'Department': ['HR', 'IT', 'HR', 'IT', 'Finance', 'Finance'],
    'Salary': [50000, 60000, 52000, 61000, 55000, 53000]
}

df = pd.DataFrame(data)
df
mean_salary=df.groupby("Department")["Salary"].mean().reset_index()
mean_salary

  Department   Salary
0    Finance  54000.0
1         HR  51000.0
2         IT  60500.0

## Task 2

In [4]:

data = {
    'Department': ['HR', 'IT', 'HR', 'IT', 'Finance', 'Finance', 'IT'],
    'Employee': ['Alice', 'Bob', 'Charlie', 'David', 'Eva', 'Frank', 'George']
}
df = pd.DataFrame(data)
print(df)
count=df.groupby("Department").size().reset_index(name="Count")
count

  Department Employee
0         HR    Alice
1         IT      Bob
2         HR  Charlie
3         IT    David
4    Finance      Eva
5    Finance    Frank
6         IT   George

  Department  Count
0    Finance      2
1         HR      2
2         IT      3

## TAsk 3

In [5]:
data = {
    'Department': ['HR', 'IT', 'HR', 'IT', 'Finance', 'Finance'],
    'Salary': [50000, 60000, 52000, 61000, 55000, 53000]
}
df=pd.DataFrame(data)
print(df)
group_by_dep=df.groupby("Department")
group_by_dep.mean()
group_by_dep.min()
group_by_dep.max()
group_by_dep['Salary'].agg(['mean', 'min', 'max'])

  Department  Salary
0         HR   50000
1         IT   60000
2         HR   52000
3         IT   61000
4    Finance   55000
5    Finance   53000

               mean    min    max
Department
Finance     54000.0  53000  55000
HR          51000.0  50000  52000
IT          60500.0  60000  61000

## Task 4

In [6]:

data = {
    'Department': ['HR', 'IT', 'HR', 'IT', 'Finance', 'Finance'],
    'Gender': ['F', 'M', 'M', 'F', 'F', 'M'],
    'Salary': [50000, 60000, 52000, 61000, 55000, 53000]
}

df = pd.DataFrame(data)
print(df)
group_by_cols=df.groupby(by=["Gender", "Department"])
group_by_cols["Salary"].agg(["mean", "std", "min", "max"])

  Department Gender  Salary
0         HR      F   50000
1         IT      M   60000
2         HR      M   52000
3         IT      F   61000
4    Finance      F   55000
5    Finance      M   53000

                      mean  std    min    max
Gender Department
F      Finance     55000.0  NaN  55000  55000
       HR          50000.0  NaN  50000  50000
       IT          61000.0  NaN  61000  61000
M      Finance     53000.0  NaN  53000  53000
       HR          52000.0  NaN  52000  52000
       IT          60000.0  NaN  60000  60000

## Task 5

In [7]:
data = {
    'Department': ['HR', 'IT', 'HR', 'IT', 'Finance', 'Finance'],
    'Salary': [50000, 60000, 52000, 61000, 55000, 53000],
    'Bonus': [2000, 2500, 1800, 2700, 2200, 2100]
}

df = pd.DataFrame(data)
print(df)
df.groupby("Department").agg({
    "Salary": ["mean", "max", "min", "std", "var"],
    "Bonus": ["mean", "max", "min", "std", "var"]
})

  Department  Salary  Bonus
0         HR   50000   2000
1         IT   60000   2500
2         HR   52000   1800
3         IT   61000   2700
4    Finance   55000   2200
5    Finance   53000   2100

             Salary                                         Bonus              \
               mean    max    min          std        var    mean   max   min
Department
Finance     54000.0  55000  53000  1414.213562  2000000.0  2150.0  2200  2100
HR          51000.0  52000  50000  1414.213562  2000000.0  1900.0  2000  1800
IT          60500.0  61000  60000   707.106781   500000.0  2600.0  2700  2500


                   std      var
Department
Finance      70.710678   5000.0
HR          141.421356  20000.0
IT          141.421356  20000.0

## Task 6

In [8]:
data = {
    'Department': ['HR', 'HR', 'IT', 'IT', 'Finance', 'Finance'],
    'Salary': [50000, 52000, 60000, 61000, 53000, 55000]
}

df = pd.DataFrame(data)
print(df)
# df['Cumulative_Sum'] = df.groupby('Department')['Salary'].cumsum()
# df['Cumulative_Product'] = df.groupby('Department')['Salary'].cumprod()
df.groupby("Department").agg({
    "Salary": ["cumsum", "cumprod"],
})

  Department  Salary
0         HR   50000
1         HR   52000
2         IT   60000
3         IT   61000
4    Finance   53000
5    Finance   55000

   Salary
   cumsum     cumprod
0   50000       50000
1  102000  2600000000
2   60000       60000
3  121000  3660000000
4   53000       53000
5  108000  2915000000

## Task 7

In [9]:
data = {
    'Department': ['HR', 'HR', 'IT', 'IT', 'Finance', 'Finance'],
    'Gender': ['F', 'M', 'F', 'M', 'F', 'M'],
    'Salary': [50000, 52000, 60000, 61000, 53000, 55000]
}

df = pd.DataFrame(data)
print(df)
pivot=df.pivot_table(index="Department", values="Salary", columns="Gender", aggfunc="mean")
pivot

  Department Gender  Salary
0         HR      F   50000
1         HR      M   52000
2         IT      F   60000
3         IT      M   61000
4    Finance      F   53000
5    Finance      M   55000

Gender            F        M
Department
Finance     53000.0  55000.0
HR          50000.0  52000.0
IT          60000.0  61000.0

## Task 8

In [10]:
data = {
    'Department': ['HR', 'HR', 'IT', 'IT', 'Finance', 'Finance'],
    'Salary': [50000, 52000, 60000, 61000, 53000, 55000]
}

df = pd.DataFrame(data)
print(df)
def salary_range(df):
    return df.max()-df.min()
df.groupby("Department").agg(salary_range).reset_index()

  Department  Salary
0         HR   50000
1         HR   52000
2         IT   60000
3         IT   61000
4    Finance   53000
5    Finance   55000

  Department  Salary
0    Finance    2000
1         HR    2000
2         IT    1000

## Task 9

In [11]:
data = {
    'Department': ['HR', 'HR', 'HR', 'IT', 'IT', 'IT', 'IT', 'Finance', 'Finance', 'Finance', "IT"],
    'Salary': [50000, 51000, 52000, 60000, 61000, 61500, 62000, 53000, 54000, 55000, 95000]
}

df = pd.DataFrame(data)
print(df)
def filter_group(group):
    return len(group) >= 5

filtered_df=df.groupby("Department").filter(filter_group)
print(df.groupby("Department").size())
filter_group

   Department  Salary
0          HR   50000
1          HR   51000
2          HR   52000
3          IT   60000
4          IT   61000
5          IT   61500
6          IT   62000
7     Finance   53000
8     Finance   54000
9     Finance   55000
10         IT   95000
Department
Finance    3
HR         3
IT         5
dtype: int64

## TAsk 10

In [12]:
data = {
    'Department': ['HR', 'HR', 'HR', 'IT', 'IT', 'IT', 'IT', 'Finance', 'Finance', 'Finance', 'IT'],
    'Salary': [50000, 51000, 52000, 60000, 61000, 61500, 62000, 53000, 54000, 55000, 95000]
}

df = pd.DataFrame(data)
print(df)
df.groupby("Department", group_keys=False).apply(lambda x: x.sort_values(by="Salary",ascending=False).head(3))

   Department  Salary
0          HR   50000
1          HR   51000
2          HR   52000
3          IT   60000
4          IT   61000
5          IT   61500
6          IT   62000
7     Finance   53000
8     Finance   54000
9     Finance   55000
10         IT   95000

/tmp/ipykernel_27856/2674549606.py:8: DeprecationWarning: DataFrameGroupBy.apply operated on the grouping columns. This behavior is deprecated, and in a future version of pandas the grouping columns will be excluded from the operation. Either pass `include_groups=False` to exclude the groupings or explicitly select the grouping columns after groupby to silence this warning.
  df.groupby("Department", group_keys=False).apply(lambda x: x.sort_values(by="Salary",ascending=False).head(3))

   Department  Salary
9     Finance   55000
8     Finance   54000
7     Finance   53000
2          HR   52000
1          HR   51000
0          HR   50000
10         IT   95000
6          IT   62000
5          IT   61500

## Task 11

In [13]:
data = {
    'Department': ['HR', 'HR', 'IT', 'IT', 'Finance', 'Finance', 'IT', 'HR', 'Finance', 'IT'],
    'Date': [
        '2021-01-01', '2021-05-15', '2020-06-01', '2020-09-25', '2021-03-20', 
        '2021-08-11', '2021-01-15', '2021-03-01', '2021-06-30', '2021-02-20'
    ]
}

df = pd.DataFrame(data)
print(df)
df["Date"]=pd.to_datetime(df["Date"])
df.groupby("Department")["Date"].agg(["min", "max"]).reset_index()

  Department        Date
0         HR  2021-01-01
1         HR  2021-05-15
2         IT  2020-06-01
3         IT  2020-09-25
4    Finance  2021-03-20
5    Finance  2021-08-11
6         IT  2021-01-15
7         HR  2021-03-01
8    Finance  2021-06-30
9         IT  2021-02-20

  Department        min        max
0    Finance 2021-03-20 2021-08-11
1         HR 2021-01-01 2021-05-15
2         IT 2020-06-01 2021-02-20

## Task 12

In [14]:
data = {
    'Department': ['HR', 'HR', 'IT', 'IT', 'Finance', 'Finance', 'IT', 'HR', 'Finance', 'IT'],
    'Date': [
        '2021-01-01', '2021-05-15', '2020-06-01', '2020-09-25', '2021-03-20',
        '2021-08-11', '2021-01-15', '2021-03-01', '2021-06-30', '2021-02-20'
    ],
    'Salary': [50000, 51000, 60000, 62000, 55000, 57000, 61000, 52000, 54000, 60000]
}

df = pd.DataFrame(data)
print(df)
df["Date"] = pd.to_datetime(df["Date"])
df=df.sort_values(by=["Department", "Date"])

  Department        Date  Salary
0         HR  2021-01-01   50000
1         HR  2021-05-15   51000
2         IT  2020-06-01   60000
3         IT  2020-09-25   62000
4    Finance  2021-03-20   55000
5    Finance  2021-08-11   57000
6         IT  2021-01-15   61000
7         HR  2021-03-01   52000
8    Finance  2021-06-30   54000
9         IT  2021-02-20   60000

## Task 13

In [18]:
data = {
    'Department': ['HR', 'HR', 'HR', 'IT', 'IT', 'IT', 'Finance', 'Finance', 'Finance'],
    'Salary': [50000, 51000, 52000, 60000, 61000, 62000, 53000, 54000, 55000]
}

df = pd.DataFrame(data)
df
df["Average_Rolling"] = df.groupby(by="Department")["Salary"].rolling(window=3, min_periods=1).mean().reset_index(level=0,drop=True)
df

  Department  Salary  Average_Rolling
0         HR   50000          50000.0
1         HR   51000          50500.0
2         HR   52000          51000.0
3         IT   60000          60000.0
4         IT   61000          60500.0
5         IT   62000          61000.0
6    Finance   53000          53000.0
7    Finance   54000          53500.0
8    Finance   55000          54000.0